FROM ubuntu us stage1 აქ შEგვიძლია გავაკეთოთ მეორე სთეიჯი რომელიც თუ მოგვინდება იმიჯში არ იქნება და ასევე როგორც 22-ე სტრიქონშია მაგ:COPY --from=stage1 file2.txt /opt/ აქ stage1 სახელია როგორც 22 სტრიქონში text.file2-ი და ეს ნიშნავს  file2.txt ჩემი კომპიუტერიდან კი არ უნდა ჩაწეროს /opt/ ფაილში, არამედ stage1-დან

FROM ubuntu as tests აქ უკვე ავტომატურად გაეშვება ტესტებზე,ტესტები იმისთვის არის რომ სწორად გიწერია თუ არა იმიჯი








FROM ubuntu

RUN apt-get update

RUN apt-get install -y vim

RUN touch text.file

RUN echo "ffkrudsfvk" > text.file

COPY text.file2 /opt/ ეს ფაილი გადაიწერება ოპტ ფოლდერში რომელიც ამ შემთხვევაში იმიჯის შიგნით არის 1რას ვიწერთ 2სად ვწერთ

CMD cat file.text => ცმდ ნიშნავს ქომანდს ანუ რა ბრძანება უნდა შესრულდეს როდესაც კონტეინერი გაეშვება ხოლო ზედა ჩამოთვლილი ბრძანებები კი შესეულდება უშუალოდ გაბილდვის დროს
